evgmolt/Tonometer/gd32f303_v1/src/main.c
/*!
    \file    main.c
    \brief   USB CDC ACM device

    \version 2020-08-01, V3.0.0, firmware for GD32F30x
    \version 2022-06-10, V3.1.0, firmware for GD32F30x
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f30x.h"
#include "cdc_acm_core.h"
#include "usbd_hw.h"
#include "gd32f30x_it.h"
#include "string.h"

#include "main.h"
#include "systick.h"
//#include "math.h"

#include "ili9341.h"
#include "fonts.h"
#include "ili9341_touch.h"

#include "DataProcessing.h"
#include "Display.h"
#include "Timers.h"

#define BKP_DATA_REG_NUM        42

#define FMC_SERIAL_PAGE_SIZE    ((uint16_t)0x30U)
#define FMC_SERIAL_START_ADDR ((uint32_t)0x0807F000U)   //Предпоследняя страница 2KB
#define FMC_SERIAL_END_ADDR     FMC_SERIAL_START_ADDR + FMC_SERIAL_PAGE_SIZE

#define FMC_RATE_START_ADDR     ((uint32_t)0x0807F800U) //Последняя страница 2KB

/* enter the second interruption,set the second interrupt flag to 1 */
__IO uint32_t timedisplay;

#define I2C0_OWN_ADDRESS7      0x72 
#define I2C0_SLAVE_ADDRESS7    0x91 

extern uint8_t wave_detect_flag;
extern double detect_level;
extern int16_t silence_time_start;
extern int16_t puls_buff[50];
extern uint8_t puls_counter;
extern double current_max;
extern int16_t detect_level_start;
extern uint8_t UART0_buff[200];
extern uint8_t UART0_count;

double pulse = 0;

uint32_t *ptrd;
uint32_t address = 0x00000000U;
uint32_t SERIAL[SERIAL_NUM_SIZE]   = {'0','2','0','2','2','2','0','0','1'};
/* calculate the number of page to be programmed/erased */


int16_t puls_buff_NEW[50]={0};
int16_t puls_buff_NEW_MIN[50]={0};
int16_t puls_buff_AMP[50]={0};
int16_t puls_buff_AMP_MIN[50]={0};

uint16_t frequency=128;

uint16_t Lo_thresh_default = 0x8000;
uint16_t Hi_thresh_default = 0x0000;

uint8_t Hi_ADS1115_config = 0b10001111;
uint8_t Lo_ADS1115_config = 0b11100100;

uint8_t ADS1115_FLAG=0;

extern const int lo_limit;  
extern const int hi_limit; 

int16_t PSys = 0;
int16_t PDia = 0;
uint16_t m_ss;
uint16_t m_mm;
uint16_t m_hh;
int indexPSys = 0;
int indexPDia = 0;
int16_t XMax = 0;
int16_t current_pressure=0;
int16_t i2c_out=0;
int i2c_out_K=0;
uint8_t indicate_charge_toggle=1;
uint8_t indicate_charge_counter=1;
uint16_t cur_day=13, cur_month=12, cur_year=2022;
uint32_t cur_thh=0,cur_tmm=0,cur_tss=0;
uint32_t cur_time=0;
uint8_t bluetooth_status=0;
uint8_t bonus_byte=0;
uint8_t mode = INIT_START;
bool ble_data_ready = false;
uint8_t ble_buffer_counter = 0;
uint8_t sim800_FLAG=0;
uint8_t rang_batt_old=99;
uint8_t i2c_transmitter[16];
uint8_t i2c_receiver[16];
uint8_t send_buff[100]={0};
uint8_t buff097[10]={0};
usb_dev usbd_cdc;
uint16_t adc_value[8];
uint16_t num_string=0;
uint16_t count_send_bluetooth=0;
short int ble_buffer[BLE_PACKET_SIZE] = {0};
short int pressure_array[MAIN_ARRAY_SIZE]={0};
uint32_t main_index = 0;
uint32_t first_max;
uint32_t total_size = 0;
short int pressure_pulsation_array[MAIN_ARRAY_SIZE]={0};
short int envelope_array[MAIN_ARRAY_SIZE]={0};
uint32_t send_counter=0;

int lock_counter = 0;

uint8_t usb_command;

double rate=18.1;
double rate_whole;
double rate_fract;

bool arrhythmia = false;
bool stop_meas = false;
bool overpumping = false;

uint8_t num_of_packet = 0;
uint8_t current_packet_num = 0;
uint8_t command;
uint8_t byte_num = 0;
uint8_t result_index = 0;
uint8_t index_in_packet = 0;
uint8_t checksum = 0;    

int main(void)
{
    nvic_configuration();      // RTC
    TimeInit();                // RTC

    GPIO_config();    
    systick_config();
    
    BootMode();        

    rcu_config();                                   // USB
    usbd_init(&usbd_cdc, &cdc_desc, &cdc_class);    // USB 
    nvic_config();                                  // USB     

    usbd_connect(&usbd_cdc);                        // USB 
    NvicConfig1();         // timer 1
    TimerConfig1();        // timer 1

    NvicConfig2();         // timer 2
    TimerConfig2();        // timer 2        
    
    i2c_config();                                                      //I2C ADS1115
    ADS1115_config(0b00000010, 0x00, 0x00);                            //Lo
    ADS1115_config(0b00000011, 0xFF, 0xFF);                            //Hi
    ADS1115_config(0b00000001, Hi_ADS1115_config, Lo_ADS1115_config);  //preconfig
    //ADS1115_read_IT();
    
    ADC_rcu_config();   // ADC0
    ADC_gpio_config();  // ADC0
    dma_config();       // ADC0
    adc_config();       // ADC0
    adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL); // ADC0    
    
    nvic_irq_enable(USART1_IRQn, 0, 0);             // UART1
    usart_config_1();                               // UART1
    usart_interrupt_enable(USART1, USART_INT_RBNE); // UART1
    
    nvic_irq_enable(USART0_IRQn, 0, 0);             // UART0
    usart_config_0();                               // UART0
    usart_interrupt_enable(USART0, USART_INT_RBNE); // UART0
        
    //while (USBD_CONFIGURED != usbd_cdc.cur_status) {/* wait for standard USB enumeration is finished */}    
        
    ILI9341_Init();
    ILI9341_Touch_init();       
    
    if (mode == USB_CHARGING)
    {
        ILI9341_FillScreen(ILI9341_BLACK);
        print_battery();
    }
    else ILI9341_FillScreen(ILI9341_WHITE);
    
    ButtonInterruptConfig();

    rate = ReadRateFromFmc();
//    rate = 18.1;    

    Timer1Start();
    
    button_released = 0;
    button_pressed_counter = 0;
    
    if (mode == INIT_START){        
        PrintHeart(true);
        PrintBluetooth(true);
        PrintGsm(true);
        PrintHeartX3(true);
        PrintSYS_label(true);
        PrintDIA_label(true);
        PrintNum(888, BIG_NUM_RIGHT, SYS_TOP, YELLOW);
        PrintNum(888, BIG_NUM_RIGHT, DIA_TOP, RED);
        PrintNum(888, BIG_NUM_RIGHT, PULSE_TOP, BLACK);        
    }
    else if (mode == PRESSURE_TEST)
    {
        ILI9341_FillRectangle(70, 150, 100, 50, ILI9341_WHITE);
    }    
        
    if (sim800_FLAG) {}      //GSM module ...        
    delay_1ms(1000);
    if (mode != USB_CHARGING) 
    {            
        ClearScreen();
    }        
        
    i2cCalibration();    

    
//    FmcSerialCheck();
    delay_1ms(200);
    memset(UART0_buff, 0, 200);
    /* PMU lock enable */
    rcu_periph_clock_enable(RCU_PMU); 
    /* BKP clock enable */
    rcu_periph_clock_enable(RCU_BKPI);
    /* enable write access to the registers in backup domain */
    pmu_backup_write_enable();
    /* clear the bit flag of tamper event */
    bkp_flag_clear(BKP_FLAG_TAMPER); 
    
    SIM800_PWRKEY_UP;
    SIM800_EXT_DOWN;
    delay_1ms(200);
    SIM800_PWRKEY_DOWN;
    delay_1ms(6);
    SIM800_EXT_UP;
    delay_1ms(100);
    SIM800_PWRKEY_UP;
    delay_1ms(100);   
    
