evgmolt/Tonometer/gd32f303_v1/src/main.c
    /* configure button pin as input */
    //gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    
    /* enable the AF clock */
    rcu_periph_clock_enable(RCU_AF);    
    
    /* enable and set key user EXTI interrupt to the lowest priority */
        nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
    nvic_irq_enable(EXTI5_9_IRQn, 2U, 2U);

    /* connect key user EXTI line to key GPIO pin */
    gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_8);

    /* configure key user EXTI line */
    exti_init(EXTI_8, EXTI_INTERRUPT, EXTI_TRIG_BOTH );
    exti_interrupt_flag_clear(EXTI_8);
}

void DeviceOff(void)
{
    PUMP_OFF;
    VALVE_FAST_OPEN;
    VALVE_SLOW_OPEN;
    ILI9341_FillScreen(ILI9341_BLACK);
    gpio_bit_reset(GPIOC, GPIO_PIN_9);
}

void i2cCalibration(void)
{
    i2c_out_K=0;
    for (int g=0 ; g<20; g++)
    {
        while (ADS1115_read_IT() == 0){}
        i2c_out_K += ((i2c_receiver[0] << 8) & 0xFF00) + (i2c_receiver[1] & 0xFF);                
    }
    i2c_out_K = i2c_out_K/20;
}

void usb_send_i2c_convers(void)
{
    i2c_convers();    
    uint8_t send_buff[3] = {25, i2c_receiver[1] ,i2c_receiver[0]};
    i2c_out = (((i2c_receiver[0] << 8) & 0xFF00) + (i2c_receiver[1] & 0xFF) - i2c_out_K);
    current_pressure = i2c_out / rate;
    usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
}

short int convert_save_16(void)
{            
    if (ADS1115_read_IT() == 0) return 0;
    pressure_array[main_index] = (((i2c_receiver[0] << 8) & 0xFF00) + (i2c_receiver[1] & 0xFF) - i2c_out_K);
    if (pressure_array[main_index] < 0) pressure_array[main_index] = 0;
    main_index++;            
    return 1;
}

short int convert_NO_save(void)
{
    if (ADS1115_read_IT()==0) return 0;
    i2c_out = (((i2c_receiver[0] << 8) & 0xFF00) + (i2c_receiver[1] & 0xFF) - i2c_out_K);
    current_pressure = i2c_out / rate;    
    return i2c_out;
}

void usb_send_16(short int T1, short int T2)
{
    uint8_t send_H1 = (T1 >> 8) & 0xFF;
    uint8_t send_L1 = T1 & 0xFF;
    uint8_t send_H2 = (T2 >> 8) & 0xFF;
    uint8_t send_L2 = T2 & 0xFF;
    uint8_t send_buff[5] = {25, send_L1, send_H1, send_L2, send_H2};
    usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
}

void BootMode(void)
{
    if (gpio_input_bit_get(GPIOB, GPIO_PIN_0))
    {
        delay_1ms(10);
        if (gpio_input_bit_get(GPIOC, GPIO_PIN_8))
        {
            gpio_bit_set(GPIOC, GPIO_PIN_9);    
            mode = INIT_START;
        }
        else if (gpio_input_bit_get(GPIOC, GPIO_PIN_10))
        {
            //gpio_bit_set(GPIOC, GPIO_PIN_9);    
            mode = USB_CHARGING;
        }
    }
}

void BluetoothCheck(void)
{ 
    if (finder(UART0_buff, "OK", 0, 0)) 
    {
        if (bluetooth_status == CONNECTED) 
        {
            bluetooth_status = DISCONNECTED;
            PrintBluetooth(true);
        }
    }
    else 
    {
        if (bluetooth_status == DISCONNECTED) 
        {
            PrintBluetooth(false);
            bluetooth_status = CONNECTED;    
        }
    }
//    send_buf_UART_0("AT\0\n",strlen("AT\0\n"));            
}

uint8_t finder(uint8_t *buff, uint8_t *_string, uint8_t _char, uint16_t *num)
{    
    uint8_t _flag=0;
    for (int j = 0; j<200; j++)
    {
        if (buff[j] == _string[0])
        {
            _flag = 1;
            for (int k = 0; k < strlen(_string); k++)
            {
                if (buff[j + k]!=_string[k]) 
                {
                    _flag = 0;
                    k = strlen(_string);
                }                                    
            }                        
        }
        if (_flag) {
                *num = j;
                buff[j] = _char;
                return 1;
        }
    }
    return 0;
}

bool FillBuff(uint8_t *buff, uint8_t ind) //переписываем из UART буфера в другой глобальный, убираем маркеры и признак действия
{
    uint8_t indexOfStartData = 4;
    uint8_t checksum = 0;    
    uint8_t index = 0;
    while (buff[index + indexOfStartData] != 0)
    {
        send_buff[index] = buff[ind + index + indexOfStartData];
        index++;
    }
    send_buff[index] = 0;
    for (int i = 0; i < index + 1; i++)
    {
        checksum += send_buff[i];
    }
    send_buff[index + 1] = buff[ind + index + indexOfStartData + 1]; //Контрольная сумма
    UART0_count = 0;
    return checksum == send_buff[index + 1];
}

uint8_t BLECommandsReceiver(uint8_t *buff)
{
    const uint8_t top = 20;
    const uint8_t left = 20;
    const uint8_t step = 20;
    bool print_allow = false; 
    uint8_t posbuf[] = {0, 0, 0, 0, 0, 0, 4, 0, 5, 0, 1, 0, 3, 0, 6, 0, 7 }; //номер строки для вывода. Команда - индекс в массиве 
//                                       log   pass  url   port  point  id
    for (int i = 0; i < UART0_count; i++)
    {
        checksum += buff[i];
        switch (byte_num)
        {
            case 0:
                if (buff[i] == '0') byte_num = 1;
                checksum = buff[i];
                index_in_packet = 0;
                break;
            case 1:
                if (buff[i] == '2') byte_num = 2;
                break;
            case 2:
                command = buff[i];
                byte_num = 3;
                break;
            case 3:
                num_of_packet = buff[i];
                current_packet_num++;
                byte_num = 4;
                break;
            case 4:
                byte_num = 5;
                break;
        }
        if (byte_num == 5)
        {
            send_buff[result_index] = buff[i];
            result_index++;
            switch (command)
            {
                case BLE_CMD_SERIAL:
                    if (result_index == 6) //длина номера -1 без '0' и '2'
                    {
                        if (checksum == buff[i + 1])
                        {
                            for (uint8_t i = 0; i < 7; i++)
                            {
                                SERIAL[i + 2] = send_buff[i];
                            }
                        }
                    }
                    FmcProgramSerial();                        
                    delay_1ms(200);                                    
                    DeviceOff();
                    return 1;
                case BLE_CMD_SETURL:
                    if (index_in_packet == BLE_PACKET_SIZE - 2)
                    {
                        index_in_packet = 0;
                        byte_num = 0;
                    }
                    print_allow = true;
                    break;
                case BLE_CMD_GETURL:
                    sprintf(send_buff,"URL222");
                    send_buf_UART_0(send_buff, 7);
                    break;
                case BLE_CMD_SETPORT:
                    print_allow = true;
                    break;
                case BLE_CMD_GETPORT:
                    sprintf(send_buff,"8080");
                    send_buf_UART_0(send_buff, 5);
                    break;
                case BLE_CMD_SETLOGIN:
                    print_allow = true;
                    break;
                case BLE_CMD_GETLOGIN:
                    sprintf(send_buff,"Login222");
                    send_buf_UART_0(send_buff, 9);
                    break;
                case BLE_CMD_SETPASSWORD:
                    print_allow = true;
                    break;
                case BLE_CMD_GETPASSWORD:
                    break;
                case BLE_CMD_SETPOINT:
                    print_allow = true;
                    break;
                case BLE_CMD_GETPOINT:
                    sprintf(send_buff,"Point222");
                    send_buf_UART_0(send_buff, 9);
                    break;
                case BLE_CMD_SETID:
                    print_allow = true;
                    break;
                case BLE_CMD_GETID:
                    sprintf(send_buff,"ID222");
                    send_buf_UART_0(send_buff, 6);
                    break;
            }
            if (buff[i] == 0)
            {
                if (checksum == buff[i + 1])
                {
                    if (print_allow) ILI9341_WriteString(left, posbuf[command] * step, send_buff, Font_Arial, ILI9341_RED, ILI9341_WHITE);  
                    checksum = 0;
                    byte_num = 0;
                    index_in_packet = 0;
                    current_packet_num = 0;
                    result_index = 0;
                }
            }
        }
        index_in_packet++;
    }
    UART0_count = 0;
}

//Остатки
uint8_t OLD_BLECommandsReceiver(uint8_t *buff, count)
{    
    uint8_t _flag=0;
    uint8_t _string[20]={'0', '2'};
    uint8_t command;
    uint8_t check_sum = 0;
    uint8_t index = 0;
    uint8_t index_of_start_data = 4;
    uint8_t data_size = 15;
    const uint8_t top = 20;
    const uint8_t left = 20;
    const uint8_t step = 20;

    for (int j = 0; j < 200; j++)
    {
        if (buff[j] == _string[0] & buff[j + 1] == _string[1])
        {
            _flag = 1;
        }
        if (_flag) 
        {
            command = buff[j + 2];
            num_of_packet = buff[j + 3]; //Номер из посылки
            current_packet_num++; //Счетчик посылок
            switch (command)
            {
            case BLE_CMD_DATETIME:
                for (int a = 0; a < 10; a++)
                {
                    check_sum += buff[j + a];
                }                                
                if (buff[j + 10] == check_sum)
                {
                    cur_day = cur_month = cur_month = cur_year = cur_tss = cur_tmm = cur_thh = 0;
                    cur_day = (uint16_t)buff[j + 3];
                    cur_month = (uint16_t)buff[j + 4];
                    cur_year = (uint16_t)(2000 + buff[j + 5]);
                    cur_tss = (uint32_t)buff[j + 6];
                    cur_tmm = (uint32_t)buff[j + 7];
                    cur_thh = (uint32_t)buff[j + 8];    
                
                    TimeSet((uint32_t)cur_thh, (uint32_t)cur_tmm, (uint32_t)cur_tss);
                    WriteBackupRegister((uint16_t)cur_day, (uint16_t)cur_month, (uint16_t)cur_year);
                
